qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC11U6X/LPC11U6x.h

/****************************************************************************************************//**
 * @file     LPC11U6x.h
 *
 * @brief    CMSIS Cortex-M0PLUS Peripheral Access Layer Header File for
 *           LPC11U6x from .
 *
 * @version  V0.4
 * @date     22. October 2013
 *
 * @note     Generated with SVDConv V2.81a 
 *           from CMSIS SVD File 'LPC11U6x.svd' Version 0.4,
 *
 *                                                                                      modified by Keil
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC11U6x
  * @{
  */

#ifndef LPC11U6X_H
#define LPC11U6X_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -----------------  Cortex-M0PLUS Processor Exceptions Numbers  ----------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */



  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */

  
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ---------------------  LPC11U6x Specific Interrupt Numbers  -------------------- */
  PIN_INT0_IRQn                 =   0,              /*!<   0  PIN_INT0                                                         */
  PIN_INT1_IRQn                 =   1,              /*!<   1  PIN_INT1                                                         */
  PIN_INT2_IRQn                 =   2,              /*!<   2  PIN_INT2                                                         */
  PIN_INT3_IRQn                 =   3,              /*!<   3  PIN_INT3                                                         */
  PIN_INT4_IRQn                 =   4,              /*!<   4  PIN_INT4                                                         */
  PIN_INT5_IRQn                 =   5,              /*!<   5  PIN_INT5                                                         */
  PIN_INT6_IRQn                 =   6,              /*!<   6  PIN_INT6                                                         */
  PIN_INT7_IRQn                 =   7,              /*!<   7  PIN_INT7                                                         */
  GINT0_IRQn                    =   8,              /*!<   8  GINT0                                                            */
  GINT1_IRQn                    =   9,              /*!<   9  GINT1                                                            */
  I2C1_IRQn                     =  10,              /*!<  10  I2C1                                                             */
  USART1_4_IRQn                 =  11,              /*!<  11  USART1_4                                                         */
  USART2_3_IRQn                 =  12,              /*!<  12  USART2_3                                                         */
  SCT0_1_IRQn                   =  13,              /*!<  13  SCT0_1                                                           */
  SSP1_IRQn                     =  14,              /*!<  14  SSP1                                                             */
  I2C0_IRQn                     =  15,              /*!<  15  I2C0                                                             */
  CT16B0_IRQn                   =  16,              /*!<  16  CT16B0                                                           */
  CT16B1_IRQn                   =  17,              /*!<  17  CT16B1                                                           */
  CT32B0_IRQn                   =  18,              /*!<  18  CT32B0                                                           */
  CT32B1_IRQn                   =  19,              /*!<  19  CT32B1                                                           */
  SSP0_IRQn                     =  20,              /*!<  20  SSP0                                                             */
  USART0_IRQn                   =  21,              /*!<  21  USART0                                                           */
  USB_IRQn                      =  22,              /*!<  22  USB                                                              */
  USB_FIQ_IRQn                  =  23,              /*!<  23  USB_FIQ                                                          */
  ADC_A_IRQn                    =  24,              /*!<  24  ADC_A                                                            */
  RTC_IRQn                      =  25,              /*!<  25  RTC                                                              */
  BOD_WDT_IRQn                  =  26,              /*!<  26  BOD_WDT                                                          */
  FLASH_IRQn                    =  27,              /*!<  27  FLASH                                                            */
  DMA_IRQn                      =  28,              /*!<  28  DMA                                                              */
  ADC_B_IRQn                    =  29,              /*!<  29  ADC_B                                                            */
  USBWAKEUP_IRQn                =  30               /*!<  30  USBWAKEUP                                                        */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

