qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC11U6X/LPC11U6x.h
/* ----------------Configuration of the Cortex-M0PLUS Processor and Core Peripherals---------------- */
#define __CM0PLUS_REV                 0x0000        /*!< Cortex-M0PLUS Core Revision                                           */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __VTOR_PRESENT                 1            /*!< Set to 1 if CPU supports Vector Table Offset Register                 */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                           /*!< Cortex-M0PLUS processor and core peripherals                          */
#include "system_LPC11U6x.h"                        /*!< LPC11U6x System                                                       */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                      I2C0                      ================ */
/* ================================================================================ */


/**
  * @brief I2C-bus controller (I2C0)
  */

typedef struct {                                    /*!< I2C0 Structure                                                        */
  __IO uint32_t  CONSET;                            /*!< I2C Control Set Register. When a one is written to a bit of
                                                         this register, the corresponding bit in the I2C control register
                                                          is set. Writing a zero has no effect on the corresponding bit
                                                          in the I2C control register.                                         */
  __I  uint32_t  STAT;                              /*!< I2C Status Register. During I2C operation, this register provides
                                                         detailed status codes that allow software to determine the next
                                                          action needed.                                                       */
  __IO uint32_t  DAT;                               /*!< I2C Data Register. During master or slave transmit mode, data
                                                         to be transmitted is written to this register. During master
                                                          or slave receive mode, data that has been received may be read
                                                          from this register.                                                  */
  __IO uint32_t  ADR0;                              /*!< I2C Slave Address Register 0. Contains the 7-bit slave address
                                                         for operation of the I2C interface in slave mode, and is not
                                                          used in master mode. The least significant bit determines whether
                                                          a slave responds to the General Call address.                        */
  __IO uint32_t  SCLH;                              /*!< SCH Duty Cycle Register High Half Word. Determines the high
                                                         time of the I2C clock.                                                */
  __IO uint32_t  SCLL;                              /*!< SCL Duty Cycle Register Low Half Word. Determines the low time
                                                         of the I2C clock. I2nSCLL and I2nSCLH together determine the
                                                          clock frequency generated by an I2C master and certain times
                                                          used in slave mode.                                                  */
  __O  uint32_t  CONCLR;                            /*!< I2C Control Clear Register. When a one is written to a bit of
                                                         this register, the corresponding bit in the I2C control register
                                                          is cleared. Writing a zero has no effect on the corresponding
                                                          bit in the I2C control register.                                     */
  __IO uint32_t  MMCTRL;                            /*!< Monitor mode control register.                                        */
  __IO uint32_t  ADR1;                              /*!< I2C Slave Address Register. Contains the 7-bit slave address
                                                         for operation of the I2C interface in slave mode, and is not
                                                          used in master mode. The least significant bit determines whether
                                                          a slave responds to the General Call address.                        */
  __IO uint32_t  ADR2;                              /*!< I2C Slave Address Register. Contains the 7-bit slave address
                                                         for operation of the I2C interface in slave mode, and is not
                                                          used in master mode. The least significant bit determines whether
                                                          a slave responds to the General Call address.                        */
  __IO uint32_t  ADR3;                              /*!< I2C Slave Address Register. Contains the 7-bit slave address
                                                         for operation of the I2C interface in slave mode, and is not
                                                          used in master mode. The least significant bit determines whether
                                                          a slave responds to the General Call address.                        */
  __I  uint32_t  DATA_BUFFER;                       /*!< Data buffer register. The contents of the 8 MSBs of the I2DAT
                                                         shift register will be transferred to the DATA_BUFFER automatically
                                                          after every nine bits (8 bits of data plus ACK or NACK) has
                                                          been received on the bus.                                            */
  __IO uint32_t  MASK0;                             /*!< I2C Slave address mask register. This mask register is associated
                                                         with I2ADR0 to determine an address match. The mask register
                                                          has no effect when comparing to the General Call address (0000000).  */
  __IO uint32_t  MASK1;                             /*!< I2C Slave address mask register. This mask register is associated
                                                         with I2ADR0 to determine an address match. The mask register
                                                          has no effect when comparing to the General Call address (0000000).  */
  __IO uint32_t  MASK2;                             /*!< I2C Slave address mask register. This mask register is associated
                                                         with I2ADR0 to determine an address match. The mask register
                                                          has no effect when comparing to the General Call address (0000000).  */
  __IO uint32_t  MASK3;                             /*!< I2C Slave address mask register. This mask register is associated
                                                         with I2ADR0 to determine an address match. The mask register
                                                          has no effect when comparing to the General Call address (0000000).  */
} LPC_I2C0_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief Windowed Watchdog Timer (WWDT) (WWDT)
  */

typedef struct {                                    /*!< WWDT Structure                                                        */
  __IO uint32_t  MOD;                               /*!< Watchdog mode register. This register contains the basic mode
                                                         and status of the Watchdog Timer.                                     */
  __IO uint32_t  TC;                                /*!< Watchdog timer constant register. This 24-bit register determines
                                                         the time-out value.                                                   */
  __O  uint32_t  FEED;                              /*!< Watchdog feed sequence register. Writing 0xAA followed by 0x55
                                                         to this register reloads the Watchdog timer with the value contained
                                                          in WDTC.                                                             */
  __I  uint32_t  TV;                                /*!< Watchdog timer value register. This 24-bit register reads out
                                                         the current value of the Watchdog timer.                              */
  __IO uint32_t  CLKSEL;                            /*!< Watchdog clock select register.                                       */
  __IO uint32_t  WARNINT;                           /*!< Watchdog Warning Interrupt compare value.                             */
  __IO uint32_t  WINDOW;                            /*!< Watchdog Window compare value.                                        */
} LPC_WWDT_Type;


/* ================================================================================ */
/* ================                     USART0                     ================ */
/* ================================================================================ */


/**
  * @brief USART0 (USART0)
  */

