qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC11U6X/LPC11U6x.h
typedef struct {                                    /*!< USART0 Structure                                                      */
  
  union {
    __IO uint32_t  DLL;                             /*!< Divisor Latch LSB. Least significant byte of the baud rate divisor
                                                         value. The full divisor is used to generate a baud rate from
                                                          the fractional rate divider. (DLAB=1)                                */
    __O  uint32_t  THR;                             /*!< Transmit Holding Register. The next character to be transmitted
                                                         is written here. (DLAB=0)                                             */
    __I  uint32_t  RBR;                             /*!< Receiver Buffer Register. Contains the next received character
                                                         to be read. (DLAB=0)                                                  */
  };
  
  union {
    __IO uint32_t  IER;                             /*!< Interrupt Enable Register. Contains individual interrupt enable
                                                         bits for the 7 potential USART interrupts. (DLAB=0)                   */
    __IO uint32_t  DLM;                             /*!< Divisor Latch MSB. Most significant byte of the baud rate divisor
                                                         value. The full divisor is used to generate a baud rate from
                                                          the fractional rate divider. (DLAB=1)                                */
  };
  
  union {
    __O  uint32_t  FCR;                             /*!< FIFO Control Register. Controls USART FIFO usage and modes.           */
    __I  uint32_t  IIR;                             /*!< Interrupt ID Register. Identifies which interrupt(s) are pending.     */
  };
  __IO uint32_t  LCR;                               /*!< Line Control Register. Contains controls for frame formatting
                                                         and break generation.                                                 */
  __IO uint32_t  MCR;                               /*!< Modem Control Register.                                               */
  __I  uint32_t  LSR;                               /*!< Line Status Register. Contains flags for transmit and receive
                                                         status, including line errors.                                        */
  __I  uint32_t  MSR;                               /*!< Modem Status Register.                                                */
  __IO uint32_t  SCR;                               /*!< Scratch Pad Register. Eight-bit temporary storage for software.       */
  __IO uint32_t  ACR;                               /*!< Auto-baud Control Register. Contains controls for the auto-baud
                                                         feature.                                                              */
  __IO uint32_t  ICR;                               /*!< IrDA Control Register. Enables and configures the IrDA (remote
                                                         control) mode.                                                        */
  __IO uint32_t  FDR;                               /*!< Fractional Divider Register. Generates a clock input for the
                                                         baud rate divider.                                                    */
  __IO uint32_t  OSR;                               /*!< Oversampling Register. Controls the degree of oversampling during
                                                         each bit time.                                                        */
  __IO uint32_t  TER;                               /*!< Transmit Enable Register. Turns off USART transmitter for use
                                                         with software flow control.                                           */
  __I  uint32_t  RESERVED0[3];
  __IO uint32_t  HDEN;                              /*!< Half duplex enable register.                                          */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SCICTRL;                           /*!< Smart Card Interface Control register. Enables and configures
                                                         the Smart Card Interface feature.                                     */
  __IO uint32_t  RS485CTRL;                         /*!< RS-485/EIA-485 Control. Contains controls to configure various
                                                         aspects of RS-485/EIA-485 modes.                                      */
  __IO uint32_t  RS485ADRMATCH;                     /*!< RS-485/EIA-485 address match. Contains the address match value
                                                         for RS-485/EIA-485 mode.                                              */
  __IO uint32_t  RS485DLY;                          /*!< RS-485/EIA-485 direction control delay.                               */
  __IO uint32_t  SYNCCTRL;                          /*!< Synchronous mode control register.                                    */
} LPC_USART0_Type;


/* ================================================================================ */
/* ================                     CT16B0                     ================ */
/* ================================================================================ */


/**
  * @brief 16-bit counter/timers CT16B0 (CT16B0)
  */

typedef struct {                                    /*!< CT16B0 Structure                                                      */
  __IO uint32_t  IR;                                /*!< Interrupt Register. The IR can be written to clear interrupts.
                                                         The IR can be read to identify which of eight possible interrupt
                                                          sources are pending.                                                 */
  __IO uint32_t  TCR;                               /*!< Timer Control Register. The TCR is used to control the Timer
                                                         Counter functions. The Timer Counter can be disabled or reset
                                                          through the TCR.                                                     */
  __IO uint32_t  TC;                                /*!< Timer Counter. The 16-bit TC is incremented every PR+1 cycles
                                                         of PCLK. The TC is controlled through the TCR.                        */
  __IO uint32_t  PR;                                /*!< Prescale Register. When the Prescale Counter (below) is equal
                                                         to this value, the next clock increments the TC and clears the
                                                          PC.                                                                  */
  __IO uint32_t  PC;                                /*!< Prescale Counter. The 16-bit PC is a counter which is incremented
                                                         to the value stored in PR. When the value in PR is reached,
                                                          the TC is incremented and the PC is cleared. The PC is observable
                                                          and controllable through the bus interface.                          */
  __IO uint32_t  MCR;                               /*!< Match Control Register. The MCR is used to control if an interrupt
                                                         is generated and if the TC is reset when a Match occurs.              */
  __IO uint32_t  MR0;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR1;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR2;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR3;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  CCR;                               /*!< Capture Control Register. The CCR controls which edges of the
                                                         capture inputs are used to load the Capture Registers and whether
                                                          or not an interrupt is generated when a capture takes place.         */
  __I  uint32_t  CR0;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  CR1;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  CR2;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  EMR;                               /*!< External Match Register. The EMR controls the match function
                                                         and the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].      */
  __I  uint32_t  RESERVED1[12];
  __IO uint32_t  CTCR;                              /*!< Count Control Register. The CTCR selects between Timer and Counter
                                                         mode, and in Counter mode selects the signal and edge(s) for
                                                          counting.                                                            */
  __IO uint32_t  PWMC;                              /*!< PWM Control Register. The PWMCON enables PWM mode for the external
                                                         match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].                       */
} LPC_CT16B0_Type;


/* ================================================================================ */
/* ================                     CT32B0                     ================ */
/* ================================================================================ */


/**
  * @brief 32-bit counter/timers CT32B0 (CT32B0)
  */

typedef struct {                                    /*!< CT32B0 Structure                                                      */
  __IO uint32_t  IR;                                /*!< Interrupt Register. The IR can be written to clear interrupts.
                                                         The IR can be read to identify which of eight possible interrupt
                                                          sources are pending.                                                 */
  __IO uint32_t  TCR;                               /*!< Timer Control Register. The TCR is used to control the Timer
                                                         Counter functions. The Timer Counter can be disabled or reset
                                                          through the TCR.                                                     */
  __IO uint32_t  TC;                                /*!< Timer Counter. The 32-bit TC is incremented every PR+1 cycles
                                                         of PCLK. The TC is controlled through the TCR.                        */
  __IO uint32_t  PR;                                /*!< Prescale Register. When the Prescale Counter (below) is equal
                                                         to this value, the next clock increments the TC and clears the
                                                          PC.                                                                  */
  __IO uint32_t  PC;                                /*!< Prescale Counter. The 32-bit PC is a counter which is incremented
                                                         to the value stored in PR. When the value in PR is reached,
                                                          the TC is incremented and the PC is cleared. The PC is observable
                                                          and controllable through the bus interface.                          */
  __IO uint32_t  MCR;                               /*!< Match Control Register. The MCR is used to control if an interrupt
                                                         is generated and if the TC is reset when a Match occurs.              */
  __IO uint32_t  MR0;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR1;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR2;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  MR3;                               /*!< Match Register. MR can be enabled through the MCR to reset the
                                                         TC, stop both the TC and PC, and/or generate an interrupt every
                                                          time MR0 matches the TC.                                             */
  __IO uint32_t  CCR;                               /*!< Capture Control Register. The CCR controls which edges of the
                                                         capture inputs are used to load the Capture Registers and whether
                                                          or not an interrupt is generated when a capture takes place.         */
  __I  uint32_t  CR0;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  CR1;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  CR2;                               /*!< Capture Register. CR is loaded with the value of TC when there
                                                         is an event on the CAP input.                                         */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  EMR;                               /*!< External Match Register. The EMR controls the match function
                                                         and the external match pins CT32Bn_MAT[3:0].                          */
  __I  uint32_t  RESERVED1[12];
  __IO uint32_t  CTCR;                              /*!< Count Control Register. The CTCR selects between Timer and Counter
                                                         mode, and in Counter mode selects the signal and edge(s) for
                                                          counting.                                                            */
  __IO uint32_t  PWMC;                              /*!< PWM Control Register. The PWMCON enables PWM mode for the external
                                                         match pins CT32Bn_MAT[3:0].                                           */
} LPC_CT32B0_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief Product name title=Kylin UM Chapter title=Kylin12-bit Analog-to-Digital Converter (ADC) Modification date=5/13/2013 Major revision=0 Minor revision=1  (ADC)
  */

