qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC11U6X/LPC11U6x.h
typedef struct {                                    /*!< DMATRIGMUX Structure                                                  */
  __IO uint32_t  DMA_ITRIG_PINMUX[16];              /*!< Trigger input select register for DMA channel 0.                      */
} LPC_DMATRIGMUX_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */


/**
  * @brief Product name title=Kylin UM Chapter title=KylinPower Management Unit (PMU) Modification date=5/13/2013 Major revision=0 Minor revision=1  (PMU)
  */

typedef struct {                                    /*!< PMU Structure                                                         */
  __IO uint32_t  PCON;                              /*!< Power control register                                                */
  __IO uint32_t  GPREG0;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG1;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG2;                            /*!< General purpose register 0                                            */
  __IO uint32_t  GPREG3;                            /*!< General purpose register 0                                            */
  __IO uint32_t  DPDCTRL;                           /*!< Deep power down control register                                      */
} LPC_PMU_Type;


/* ================================================================================ */
/* ================                    FLASHCTRL                   ================ */
/* ================================================================================ */


/**
  * @brief Flash controller  (FLASHCTRL)
  */

typedef struct {                                    /*!< FLASHCTRL Structure                                                   */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  FLASHCFG;                          /*!< Flash configuration register                                          */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  FMSSTART;                          /*!< Signature start address register                                      */
  __IO uint32_t  FMSSTOP;                           /*!< Signature stop-address register                                       */
  __I  uint32_t  RESERVED2;
  __I  uint32_t  FMSW0;                             /*!< Signature Word                                                        */
} LPC_FLASHCTRL_Type;


/* ================================================================================ */
/* ================                      SSP0                      ================ */
/* ================================================================================ */


/**
  * @brief SSP/SPI  (SSP0)
  */

typedef struct {                                    /*!< SSP0 Structure                                                        */
  __IO uint32_t  CR0;                               /*!< Control Register 0. Selects the serial clock rate, bus type,
                                                         and data size.                                                        */
  __IO uint32_t  CR1;                               /*!< Control Register 1. Selects master/slave and other modes.             */
  __IO uint32_t  DR;                                /*!< Data Register. Writes fill the transmit FIFO, and reads empty
                                                         the receive FIFO.                                                     */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __IO uint32_t  CPSR;                              /*!< Clock Prescale Register                                               */
  __IO uint32_t  IMSC;                              /*!< Interrupt Mask Set and Clear Register                                 */
  __I  uint32_t  RIS;                               /*!< Raw Interrupt Status Register                                         */
  __I  uint32_t  MIS;                               /*!< Masked Interrupt Status Register                                      */
  __O  uint32_t  ICR;                               /*!< SSPICR Interrupt Clear Register                                       */
} LPC_SSP0_Type;


/* ================================================================================ */
/* ================                      IOCON                     ================ */
/* ================================================================================ */


/**
  * @brief Product name title=Kylin UM Chapter title=KylinI/O control (IOCON) Modification date=5/13/2013 Major revision=0 Minor revision=1  (IOCON)
  */

typedef struct {                                    /*!< IOCON Structure                                                       */
  __IO uint32_t  PIO0_0;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_1;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_2;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_3;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_4;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_5;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_6;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_7;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_8;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_9;                            /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_10;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_11;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_12;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_13;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_14;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_15;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_16;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_17;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_18;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_19;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_20;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_21;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_22;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO0_23;                           /*!< I/O configuration for port PIO0                                       */
  __IO uint32_t  PIO1_0;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_1;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_2;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_3;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_4;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_5;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_6;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_7;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_8;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_9;                            /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_10;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_11;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_12;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_13;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_14;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_15;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_16;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_17;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_18;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_19;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_20;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_21;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_22;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_23;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_24;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_25;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_26;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_27;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_28;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_29;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_30;                           /*!< I/O configuration for port PIO1                                       */
  __IO uint32_t  PIO1_31;                           /*!< I/O configuration for port PIO1                                       */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  PIO2_0;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_1;                            /*!< I/O configuration for port PIO2                                       */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  PIO2_2;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_3;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_4;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_5;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_6;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_7;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_8;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_9;                            /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_10;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_11;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_12;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_13;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_14;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_15;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_16;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_17;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_18;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_19;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_20;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_21;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_22;                           /*!< I/O configuration for port PIO2                                       */
  __IO uint32_t  PIO2_23;                           /*!< I/O configuration for port PIO2                                       */
} LPC_IOCON_Type;


/* ================================================================================ */
/* ================                     SYSCON                     ================ */
/* ================================================================================ */


/**
  * @brief Product name title=Kylin UM Chapter title=KylinSystem configuration (SYSCON) Modification date=5/13/2013 Major revision=0 Minor revision=1  (SYSCON)
  */

